In [128]:
import numpy as np
import pandas as pd
from IPython.display import Markdown,display
def printmd(message,data):
    text="**<u>"+message+"</u>**"
    display(Markdown(text),data)
df = pd.read_csv("mobile.csv")
df['First Name']=df['Customer Name'].apply(lambda fullName:fullName.split(' ')[0])
df['Cell Company']=df['Phone Number'].apply(lambda fullNumber:fullNumber.split('-')[0]).replace({'050':'Pelephone','051':'Golan','052':'Cellcom','053':'Motorola','054':'Partner'})
printmd('count each company:',df['Cell Company'].value_counts())
printmd('unique company names:',list(df['Cell Company'].unique()))
printmd('total count of unique company names:', df['Cell Company'].nunique())
df['User Type']= np.vectorize(lambda talked_timer,surf_time:'talker' if talked_timer>surf_time else 'Surfer')(df['Talked'],df['Internet'])
df['User Type']= df.apply(lambda row:'talker' if row['Talked']>row['Internet'] else 'Surfer',axis=1)
df.sort_values(by='Talked',ascending=True,inplace=True)
df.sort_values(by=['Talked','Internet'],ascending=True,inplace=True)
printmd("5 most talkers:",df.nlargest(5,columns=['Talked']))
printmd("3 least talkers:",df.nsmallest(3,columns=['Talked']))
printmd("the duplicated rows:",df[df.duplicated()])
df.drop_duplicates(inplace=True)
printmd('random 3 subscribers:',df.sample(3)[['Customer Name','Phone Number']])

**<u>count each company:</u>**

Cell Company
Pelephone    9
Golan        9
Cellcom      7
Motorola     5
Partner      5
Name: count, dtype: int64

**<u>unique company names:</u>**

['Pelephone', 'Motorola', 'Golan', 'Partner', 'Cellcom']

**<u>total count of unique company names:</u>**

5

**<u>5 most talkers:</u>**

,Customer Name,Phone Number,Talked,Internet,Start Subscription,First Name,Cell Company,User Type
17,Matthew Mills,052-7974129,670,571,08/07/2022,Matthew,Cellcom,talker
29,Jennifer Zavala,053-8258482,591,202,29/06/2020,Jennifer,Motorola,talker
12,Sierra Morgan,054-6460585,590,614,17/04/2023,Sierra,Partner,Surfer
22,Angela Waters,054-5779698,553,201,19/10/2020,Angela,Partner,talker
11,Aaron Melendez,050-8270179,553,871,29/01/2023,Aaron,Pelephone,Surfer

**<u>3 least talkers:</u>**

,Customer Name,Phone Number,Talked,Internet,Start Subscription,First Name,Cell Company,User Type
27,Sarah Martin,051-6973566,24,91,12/04/2023,Sarah,Golan,Surfer
16,Chad Carter,053-9294578,25,350,06/10/2020,Chad,Motorola,Surfer
28,Gregory Stevens,052-7378700,30,858,09/08/2022,Gregory,Cellcom,Surfer

**<u>the duplicated rows:</u>**

,Customer Name,Phone Number,Talked,Internet,Start Subscription,First Name,Cell Company,User Type
33,Alison Moore,050-6467180,105,579,29/11/2020,Alison,Pelephone,Surfer
24,Jessica Pittman,053-9160566,170,899,23/03/2023,Jessica,Motorola,Surfer
32,Evelyn Elliott,051-6233404,369,705,17/10/2022,Evelyn,Golan,Surfer
3,John Dean,054-2952436,435,817,06/01/2021,John,Partner,Surfer
25,Ryan Aguirre,050-4964995,520,372,07/11/2023,Ryan,Pelephone,talker

**<u>random 3 subscribers:</u>**

      Customer Name Phone Number
26     Alison Moore  050-6467180
31        John Dean  054-2952436
29  Jennifer Zavala  053-8258482